# Terminal setup — brew bundle --file=Brewfile

# Terminal + multiplexer
cask "ghostty"
brew "tmux"

# Prompt + zsh
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Navigation / search
brew "fzf"
brew "zoxide"
brew "fd"
brew "ripgrep"

# Better coreutils replacements
brew "eza"        # ls
brew "bat"        # cat
brew "btop"       # top
brew "git-delta"  # git diff pager

# History + help
brew "atuin"      # Ctrl-R
brew "tlrc"       # tldr
